app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@hospital.com'
 LIMIT 1
---
	public function loginSubmit()
	{
		$email = $this->request->getPost('email');
		$password = $this->request->getPost('password');
		$role = $this->request->getPost('role');

		// Check if all fields are filled
		if (empty($email) || empty($password) || empty($role)) {
			return redirect()->to('/login')->with('error', 'Please fill in all fields');
		}

		$userModel = new UserModel();
		$user = $userModel->where('email', $email)->first();